app/views/recipes/new.html.erb

SELECT "users".* FROM "users"
---
  <%= r.label "User" %>
  <%= r.collection_select(:user_id, User.all, :id, :name, {:prompt => 'Select User'}) %>