app/views/users/show.html.erb

SELECT "recipes".* FROM "recipes" WHERE "recipes"."user_id" = ?  [["user_id", 1]]
---
<ul>
  <% @user.recipes.each do |r| %>

SELECT "ingredients".* FROM "ingredients" INNER JOIN "allergens" ON "ingredients"."id" = "allergens"."ingredient_id" WHERE "allergens"."user_id" = ?  [["user_id", 3]]
---
 <ul>
 	<% @user.ingredients.each do |i| %>