app/views/ingredients/show.html.erb

SELECT "recipes".* FROM "recipes" INNER JOIN "recipe_ingredients" ON "recipes"."id" = "recipe_ingredients"."recipe_id" WHERE "recipe_ingredients"."ingredient_id" = ?  [["ingredient_id", 1]]
---
<ul>
  <% @ingredient.recipes.each do |r| %>

SELECT "users".* FROM "users" INNER JOIN "allergens" ON "users"."id" = "allergens"."user_id" WHERE "allergens"."ingredient_id" = ?  [["ingredient_id", 1]]
SELECT  1 AS one FROM "users" INNER JOIN "allergens" ON "users"."id" = "allergens"."user_id" WHERE "allergens"."ingredient_id" = ? LIMIT ?  [["ingredient_id", 5], ["LIMIT", 1]]
---

<% if !@ingredient.users.empty? %>

SELECT "users".* FROM "users" INNER JOIN "allergens" ON "users"."id" = "allergens"."user_id" WHERE "allergens"."ingredient_id" = ?  [["ingredient_id", 5]]
---
 <ul>
 	<% @ingredient.users.each do |u| %>