app/controllers/recipes_controller.rb

SELECT "recipes".* FROM "recipes" ORDER BY ingredients.count DESC
---
  def index
    @recipes = Recipe.all

INSERT INTO "recipes" ("name", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "pasta"], ["user_id", 5], ["created_at", "2019-05-02 15:13:56.102540"], ["updated_at", "2019-05-02 15:13:56.102540"]]
---
  def create
    @recipe = Recipe.create(strong_params)