app/models/recipe.rb

SELECT COUNT(*) FROM "ingredients" INNER JOIN "recipe_ingredients" ON "ingredients"."id" = "recipe_ingredients"."ingredient_id" WHERE "recipe_ingredients"."recipe_id" = ?  [["recipe_id", 13]]
---
  def ingredients_count
  	self.ingredients.count

SELECT  "recipes".* FROM "recipes" WHERE "recipes"."name" = ? LIMIT ?  [["name", "Pizza"], ["LIMIT", 1]]
SELECT  1 AS one FROM "ingredients" INNER JOIN "recipe_ingredients" ON "ingredients"."id" = "recipe_ingredients"."ingredient_id" WHERE "recipe_ingredients"."recipe_id" = ? LIMIT ?  [["recipe_id", 6], ["LIMIT", 1]]
SELECT "recipes".* FROM "recipes"
SELECT COUNT(*) FROM "ingredients" INNER JOIN "recipe_ingredients" ON "ingredients"."id" = "recipe_ingredients"."ingredient_id" WHERE "recipe_ingredients"."recipe_id" = ?  [["recipe_id", 1]]
---
  def self.search(search)
  	if search
  		recipe = Recipe.find_by(name: search)
  		if recipe
  			if !recipe.ingredients.empty?
  				self.where(name: search)
  			else
  				self.where(name: search)
  			end
  		else
  			Recipe.all.joins(:recipe_ingredients).group("name").order('COUNT(recipe_ingredients.id) DESC')
  		end
  	else
  		Recipe.all.left_joins(:recipe_ingredients).group("name").order('COUNT(recipe_ingredients.id) DESC')